Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     (None, 19, 6)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 19, 500)           3500      
_________________________________________________________________
dense_7 (Dense)              (None, 19, 400)           200400    
_________________________________________________________________
dense_8 (Dense)              (None, 19, 300)           120300    
_________________________________________________________________
dense_9 (Dense)              (None, 19, 200)           60200     
_________________________________________________________________
dense_10 (Dense)             (None, 19, 100)           20100     
_________________________________________________________________
output (Dense)               (None, 19, 6)             606       
=================================================================
Total params: 405,106
Trainable params: 405,106
Non-trainable params: 0
_________________________________________________________________
