Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     (None, 19, 6)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 19, 500)           3500      
_________________________________________________________________
dense_2 (Dense)              (None, 19, 400)           200400    
_________________________________________________________________
dense_3 (Dense)              (None, 19, 300)           120300    
_________________________________________________________________
dense_4 (Dense)              (None, 19, 200)           60200     
_________________________________________________________________
dense_5 (Dense)              (None, 19, 100)           20100     
_________________________________________________________________
dense_6 (Dense)              (None, 19, 200)           20200     
_________________________________________________________________
dense_7 (Dense)              (None, 19, 300)           60300     
_________________________________________________________________
dense_8 (Dense)              (None, 19, 400)           120400    
_________________________________________________________________
dense_9 (Dense)              (None, 19, 500)           200500    
_________________________________________________________________
output (Dense)               (None, 19, 6)             3006      
=================================================================
Total params: 808,906
Trainable params: 808,906
Non-trainable params: 0
_________________________________________________________________
