Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     (None, 19, 8)             0         
_________________________________________________________________
dense_19 (Dense)             (None, 19, 500)           4500      
_________________________________________________________________
dense_20 (Dense)             (None, 19, 400)           200400    
_________________________________________________________________
dense_21 (Dense)             (None, 19, 300)           120300    
_________________________________________________________________
dense_22 (Dense)             (None, 19, 200)           60200     
_________________________________________________________________
dense_23 (Dense)             (None, 19, 100)           20100     
_________________________________________________________________
dense_24 (Dense)             (None, 19, 200)           20200     
_________________________________________________________________
dense_25 (Dense)             (None, 19, 300)           60300     
_________________________________________________________________
dense_26 (Dense)             (None, 19, 400)           120400    
_________________________________________________________________
dense_27 (Dense)             (None, 19, 500)           200500    
_________________________________________________________________
output (Dense)               (None, 19, 8)             4008      
=================================================================
Total params: 810,908
Trainable params: 810,908
Non-trainable params: 0
_________________________________________________________________
